import React from "react";
import { data } from "../../data/data";
import { useParams } from "react-router-dom";
import Navbar from "../../components/Navbar/Navbar";
import Title from "../../components/Title/Title";
import { Link } from "react-router-dom";
import "./Post.css";
import RelatedArticle from "./RelatedArticle";
import Footer from "../../components/Footer/Footer";

const Post = () => {
  type posts = {
    id: string;
    title: string;
    description: string;
    image: string;
  };
  const posts = [
    {
      id: "1",
      title: "اولین پست من",
      description: "به نام خداوند جان و خرد، کزان برتر اندیشه بر نگذرد",
      context:
        "درحالی‌که هواداران بی‌صبرانه منتظر ادامه داستان سریال The Last of Us (آخرین بازمانده از ما) هستند، اظهارات اخیر مدیر ارشد اچ‌بی‌اُ شوک بزرگی به آن‌ها وارد کرده است. کیسی بلویز در پاسخ به سؤالی درباره پایان مجموعه با فصل سوم گفت: «قطعا این‌طور به‌نظر می‌رسد.» با اینکه پیش از این کریگ مازن، شورانر سریال لست آو آس معتقد بود که برای اتمام داستان به چهار فصل نیاز است، اما حالا ورق برگشته است. کیسی بلویز تأکید کرد که تصمیم نهایی با کریگ مازن است: «کریگ مازن هنوز مشغول بررسی این موضوع است که آیا داستان را در دو فصل دیگر روایت کند یا همه چیز را در یک فصل طولانی به پایان برساند. من کاملاً پیرو تصمیم کریگ مازن هستم.» یکی از دلایل اصلی برای پایان احتمالی سریال The Last of Us در فصل سوم، نبود منبع اقتباس است. کریگ مازن بارها اعلام کرده است که هرگز قصد ندارد پا را فراتر از داستان بازی‌ها بگذارد و اشتباه سریال Game of Thrones (ادامه دادن داستان بدون کتاب) را تکرار نخواهد کرد. باتوجه‌به اینکه هنوز خبری از بازی The Last of Us Part 3 نیست، پایان‌دادن به سریال در فصل سوم منطقی‌ترین راه برای جلوگیری از «کش‌دادن» بیهوده داستان به‌نظر می‌رسد.",
      image: "/assets/gaming/gallery_1.png",
    },
    {
      id: "2",
      title: "دومین پست من",
      description: "به نام خداوند جان و خرد، کزان برتر اندیشه بر نگذرد",
      context:
        "درحالی‌که هواداران بی‌صبرانه منتظر ادامه داستان سریال The Last of Us (آخرین بازمانده از ما) هستند، اظهارات اخیر مدیر ارشد اچ‌بی‌اُ شوک بزرگی به آن‌ها وارد کرده است. کیسی بلویز در پاسخ به سؤالی درباره پایان مجموعه با فصل سوم گفت: «قطعا این‌طور به‌نظر می‌رسد.» با اینکه پیش از این کریگ مازن، شورانر سریال لست آو آس معتقد بود که برای اتمام داستان به چهار فصل نیاز است، اما حالا ورق برگشته است. کیسی بلویز تأکید کرد که تصمیم نهایی با کریگ مازن است: «کریگ مازن هنوز مشغول بررسی این موضوع است که آیا داستان را در دو فصل دیگر روایت کند یا همه چیز را در یک فصل طولانی به پایان برساند. من کاملاً پیرو تصمیم کریگ مازن هستم.» یکی از دلایل اصلی برای پایان احتمالی سریال The Last of Us در فصل سوم، نبود منبع اقتباس است. کریگ مازن بارها اعلام کرده است که هرگز قصد ندارد پا را فراتر از داستان بازی‌ها بگذارد و اشتباه سریال Game of Thrones (ادامه دادن داستان بدون کتاب) را تکرار نخواهد کرد. باتوجه‌به اینکه هنوز خبری از بازی The Last of Us Part 3 نیست، پایان‌دادن به سریال در فصل سوم منطقی‌ترین راه برای جلوگیری از «کش‌دادن» بیهوده داستان به‌نظر می‌رسد.",
      image: "/assets/gaming/gallery_2.png",
    },
    {
      id: "3",
      title: "سومین پست من",
      description: "کار عمیق",
      context:
        "درحالی‌که هواداران بی‌صبرانه منتظر ادامه داستان سریال The Last of Us (آخرین بازمانده از ما) هستند، اظهارات اخیر مدیر ارشد اچ‌بی‌اُ شوک بزرگی به آن‌ها وارد کرده است. کیسی بلویز در پاسخ به سؤالی درباره پایان مجموعه با فصل سوم گفت: «قطعا این‌طور به‌نظر می‌رسد.» با اینکه پیش از این کریگ مازن، شورانر سریال لست آو آس معتقد بود که برای اتمام داستان به چهار فصل نیاز است، اما حالا ورق برگشته است. کیسی بلویز تأکید کرد که تصمیم نهایی با کریگ مازن است: «کریگ مازن هنوز مشغول بررسی این موضوع است که آیا داستان را در دو فصل دیگر روایت کند یا همه چیز را در یک فصل طولانی به پایان برساند. من کاملاً پیرو تصمیم کریگ مازن هستم.» یکی از دلایل اصلی برای پایان احتمالی سریال The Last of Us در فصل سوم، نبود منبع اقتباس است. کریگ مازن بارها اعلام کرده است که هرگز قصد ندارد پا را فراتر از داستان بازی‌ها بگذارد و اشتباه سریال Game of Thrones (ادامه دادن داستان بدون کتاب) را تکرار نخواهد کرد. باتوجه‌به اینکه هنوز خبری از بازی The Last of Us Part 3 نیست، پایان‌دادن به سریال در فصل سوم منطقی‌ترین راه برای جلوگیری از «کش‌دادن» بیهوده داستان به‌نظر می‌رسد.",
      image: "/assets/gaming/gallery_3.png",
    },
    {
      id: "4",
      title: "سومین پست من",
      description: "کار عمیق",
      context:
        "درحالی‌که هواداران بی‌صبرانه منتظر ادامه داستان سریال The Last of Us (آخرین بازمانده از ما) هستند، اظهارات اخیر مدیر ارشد اچ‌بی‌اُ شوک بزرگی به آن‌ها وارد کرده است. کیسی بلویز در پاسخ به سؤالی درباره پایان مجموعه با فصل سوم گفت: «قطعا این‌طور به‌نظر می‌رسد.» با اینکه پیش از این کریگ مازن، شورانر سریال لست آو آس معتقد بود که برای اتمام داستان به چهار فصل نیاز است، اما حالا ورق برگشته است. کیسی بلویز تأکید کرد که تصمیم نهایی با کریگ مازن است: «کریگ مازن هنوز مشغول بررسی این موضوع است که آیا داستان را در دو فصل دیگر روایت کند یا همه چیز را در یک فصل طولانی به پایان برساند. من کاملاً پیرو تصمیم کریگ مازن هستم.» یکی از دلایل اصلی برای پایان احتمالی سریال The Last of Us در فصل سوم، نبود منبع اقتباس است. کریگ مازن بارها اعلام کرده است که هرگز قصد ندارد پا را فراتر از داستان بازی‌ها بگذارد و اشتباه سریال Game of Thrones (ادامه دادن داستان بدون کتاب) را تکرار نخواهد کرد. باتوجه‌به اینکه هنوز خبری از بازی The Last of Us Part 3 نیست، پایان‌دادن به سریال در فصل سوم منطقی‌ترین راه برای جلوگیری از «کش‌دادن» بیهوده داستان به‌نظر می‌رسد.",
      image: "/assets/gaming/gallery_4.png",
    },
  ];
  const { id } = useParams();
  const post = posts.find((p) => p.id === id);

  if (!post) return <div>Not Found</div>;
  return (
    <>
      <Navbar />
      <div className="article-page">
        <section className="article-section">
          <div className="article-sidebar">
            <Title title="تازه ترین مطالب" />
            {posts.map((post) => (
              <div className="article-article">
                <Link to={`/post/${post.id}`}>
                  <img src={post.image} alt={post.title} />
                  <div className="sidebar-article-info">
                    <p>{post.title}</p>
                  </div>
                </Link>
              </div>
            ))}
          </div>
          <div className="article">
            <article>
              <h1>{post.title}</h1>
              <div className="post-info">
                <div className="tags">
                  <p>اخبار</p>
                  <p>اخبار</p>
                  <p>اخبار</p>
                </div>
                <span className="created-time">24 خرداد 1400</span>
              </div>
              <div className="post-author">
                <img
                  src="/assets/gaming/avatar.png"
                  className="author-avatar"
                  alt=""
                />
                <span className="author">علی محمدی</span>
              </div>
              <img src={post.image} alt={post.title} />
              <div className="post-context">
                <p className="post-description">{post.description}</p>

                <p>{post.context}</p>
              </div>
            </article>
            <RelatedArticle />
          </div>
        </section>
        <section className="comments-section">
          <div className="comments">
            <div className="comment">
              <div className="profile">
                <img src="" alt="avatar" />
                <p>Username</p>
              </div>
              <p>این نظر من اتس.</p>
            </div>
          </div>
        </section>
      </div>
      <Footer />
    </>
  );
};

export default Post;
