import React from "react";
import "./Post.css";
import Title from "../../components/Title/Title";
import { Link } from "react-router-dom";

const RelatedArticle = () => {
  type posts = {
    id: string;
    title: string;
    description: string;
    image: string;
  };
  const posts = [
    {
      id: "1",
      title: "اولین پست من",
      description: "به نام خداوند جان و خرد، کزان برتر اندیشه بر نگذرد",
      context:
        "درحالی‌که هواداران بی‌صبرانه منتظر ادامه داستان سریال The Last of Us (آخرین بازمانده از ما) هستند، اظهارات اخیر مدیر ارشد اچ‌بی‌اُ شوک بزرگی به آن‌ها وارد کرده است. کیسی بلویز در پاسخ به سؤالی درباره پایان مجموعه با فصل سوم گفت: «قطعا این‌طور به‌نظر می‌رسد.» با اینکه پیش از این کریگ مازن، شورانر سریال لست آو آس معتقد بود که برای اتمام داستان به چهار فصل نیاز است، اما حالا ورق برگشته است. کیسی بلویز تأکید کرد که تصمیم نهایی با کریگ مازن است: «کریگ مازن هنوز مشغول بررسی این موضوع است که آیا داستان را در دو فصل دیگر روایت کند یا همه چیز را در یک فصل طولانی به پایان برساند. من کاملاً پیرو تصمیم کریگ مازن هستم.» یکی از دلایل اصلی برای پایان احتمالی سریال The Last of Us در فصل سوم، نبود منبع اقتباس است. کریگ مازن بارها اعلام کرده است که هرگز قصد ندارد پا را فراتر از داستان بازی‌ها بگذارد و اشتباه سریال Game of Thrones (ادامه دادن داستان بدون کتاب) را تکرار نخواهد کرد. باتوجه‌به اینکه هنوز خبری از بازی The Last of Us Part 3 نیست، پایان‌دادن به سریال در فصل سوم منطقی‌ترین راه برای جلوگیری از «کش‌دادن» بیهوده داستان به‌نظر می‌رسد.",
      image: "/assets/gaming/gallery_1.png",
    },
    {
      id: "2",
      title: "دومین پست من",
      description: "به نام خداوند جان و خرد، کزان برتر اندیشه بر نگذرد",
      context:
        "درحالی‌که هواداران بی‌صبرانه منتظر ادامه داستان سریال The Last of Us (آخرین بازمانده از ما) هستند، اظهارات اخیر مدیر ارشد اچ‌بی‌اُ شوک بزرگی به آن‌ها وارد کرده است. کیسی بلویز در پاسخ به سؤالی درباره پایان مجموعه با فصل سوم گفت: «قطعا این‌طور به‌نظر می‌رسد.» با اینکه پیش از این کریگ مازن، شورانر سریال لست آو آس معتقد بود که برای اتمام داستان به چهار فصل نیاز است، اما حالا ورق برگشته است. کیسی بلویز تأکید کرد که تصمیم نهایی با کریگ مازن است: «کریگ مازن هنوز مشغول بررسی این موضوع است که آیا داستان را در دو فصل دیگر روایت کند یا همه چیز را در یک فصل طولانی به پایان برساند. من کاملاً پیرو تصمیم کریگ مازن هستم.» یکی از دلایل اصلی برای پایان احتمالی سریال The Last of Us در فصل سوم، نبود منبع اقتباس است. کریگ مازن بارها اعلام کرده است که هرگز قصد ندارد پا را فراتر از داستان بازی‌ها بگذارد و اشتباه سریال Game of Thrones (ادامه دادن داستان بدون کتاب) را تکرار نخواهد کرد. باتوجه‌به اینکه هنوز خبری از بازی The Last of Us Part 3 نیست، پایان‌دادن به سریال در فصل سوم منطقی‌ترین راه برای جلوگیری از «کش‌دادن» بیهوده داستان به‌نظر می‌رسد.",
      image: "/assets/gaming/gallery_2.png",
    },
    {
      id: "3",
      title: "سومین پست من",
      description: "کار عمیق",
      context:
        "درحالی‌که هواداران بی‌صبرانه منتظر ادامه داستان سریال The Last of Us (آخرین بازمانده از ما) هستند، اظهارات اخیر مدیر ارشد اچ‌بی‌اُ شوک بزرگی به آن‌ها وارد کرده است. کیسی بلویز در پاسخ به سؤالی درباره پایان مجموعه با فصل سوم گفت: «قطعا این‌طور به‌نظر می‌رسد.» با اینکه پیش از این کریگ مازن، شورانر سریال لست آو آس معتقد بود که برای اتمام داستان به چهار فصل نیاز است، اما حالا ورق برگشته است. کیسی بلویز تأکید کرد که تصمیم نهایی با کریگ مازن است: «کریگ مازن هنوز مشغول بررسی این موضوع است که آیا داستان را در دو فصل دیگر روایت کند یا همه چیز را در یک فصل طولانی به پایان برساند. من کاملاً پیرو تصمیم کریگ مازن هستم.» یکی از دلایل اصلی برای پایان احتمالی سریال The Last of Us در فصل سوم، نبود منبع اقتباس است. کریگ مازن بارها اعلام کرده است که هرگز قصد ندارد پا را فراتر از داستان بازی‌ها بگذارد و اشتباه سریال Game of Thrones (ادامه دادن داستان بدون کتاب) را تکرار نخواهد کرد. باتوجه‌به اینکه هنوز خبری از بازی The Last of Us Part 3 نیست، پایان‌دادن به سریال در فصل سوم منطقی‌ترین راه برای جلوگیری از «کش‌دادن» بیهوده داستان به‌نظر می‌رسد.",
      image: "/assets/gaming/gallery_3.png",
    },
    {
      id: "4",
      title: "سومین پست من",
      description: "کار عمیق",
      context:
        "درحالی‌که هواداران بی‌صبرانه منتظر ادامه داستان سریال The Last of Us (آخرین بازمانده از ما) هستند، اظهارات اخیر مدیر ارشد اچ‌بی‌اُ شوک بزرگی به آن‌ها وارد کرده است. کیسی بلویز در پاسخ به سؤالی درباره پایان مجموعه با فصل سوم گفت: «قطعا این‌طور به‌نظر می‌رسد.» با اینکه پیش از این کریگ مازن، شورانر سریال لست آو آس معتقد بود که برای اتمام داستان به چهار فصل نیاز است، اما حالا ورق برگشته است. کیسی بلویز تأکید کرد که تصمیم نهایی با کریگ مازن است: «کریگ مازن هنوز مشغول بررسی این موضوع است که آیا داستان را در دو فصل دیگر روایت کند یا همه چیز را در یک فصل طولانی به پایان برساند. من کاملاً پیرو تصمیم کریگ مازن هستم.» یکی از دلایل اصلی برای پایان احتمالی سریال The Last of Us در فصل سوم، نبود منبع اقتباس است. کریگ مازن بارها اعلام کرده است که هرگز قصد ندارد پا را فراتر از داستان بازی‌ها بگذارد و اشتباه سریال Game of Thrones (ادامه دادن داستان بدون کتاب) را تکرار نخواهد کرد. باتوجه‌به اینکه هنوز خبری از بازی The Last of Us Part 3 نیست، پایان‌دادن به سریال در فصل سوم منطقی‌ترین راه برای جلوگیری از «کش‌دادن» بیهوده داستان به‌نظر می‌رسد.",
      image: "/assets/gaming/gallery_4.png",
    },
  ];
  return (
    <div className="related-section">
      <Title title="مقاله های مرتبط" />
      <div className="related-articles">
        {posts.map((post) => (
          <Link to={`/post/${post.id}`}>
            <div className="related-article">
              <img src={post.image} alt={post.title} />
              <h3>{post.title}</h3>
            </div>
          </Link>
        ))}
      </div>
    </div>
  );
};

export default RelatedArticle;
